{
    "title": "Аналог Mario",
    "description": "Будущее описание",
    "pathIcon": "1",
    "lessons": [
        {
            "title": "Запуск проекта",
            "description": [
                "Описание запуска проекта"
            ],
            "video": null
        },
        {
            "title": "Создание первого уровня",
            "description": [
                "    В ходе данного урока вы сможете сделать платформу, по которой в будущем будет двигаться наш персонаж.",
                "    Для начала необходимо открыть Unity, в окне с файлами проекта найти папку Assets, а уже в ней папку Sprites, в которой находятся необходимые для проекта спрайты. Если дважды нажмёте на спрайт с именем Tileset, то он откроется как картинка. Здесь вы можете увидеть сетку из разных спрайтов. Что же с ними необходимо сделать, что пользоваться в дальнейшем?",
                "    Если просто переместить изображение на сцену, то вы не сможете взять отдельные элементы из неё.",
                "    Так как Tileset пиксельный, он может размываться. Что бы избежать этого во вкладке Inspector в строчке Filter Mode необходимо поставить значение “Point (no filter)”, а в Sprite Mode необходимо выбрать “Multiple” (так Unity поймёт, что у нас есть целая сетка спрайтов, а не один) и нажать на кнопку Apply ниже. Далее, при нажатии на кнопку Sprite Editor, открываете спрайт.",
                "<style=\"Sprite\"><sprite index=0></style>",
                "    В левом верхнем углу появившегося окна нажмите на Slice. В открывшемся окошке необходимо поменять Type на “Grid By Cell Size”, указать размеры (в Марио используется 16х16) и нажать на кнопку Slice. Если ничего не менять, а сразу нажать на кнопку, Unity выделит всю картинку как один большой спрайт, но нам это не нужно.",
                "<style=\"Sprite\"><sprite index=1></style>",
                "    В самом низу изображения вы можете увидеть тучки, которые автоматически поделились на 6 частей. Исправим это. Нажимаете на каждый кубик и удаляете его кнопкой Delete. Теперь выделите каждую из них как отдельный объект: зажимаете ЛКМ и выделяете облака по их границам. Если выделение получилось неровным, то можете его исправить, потянув за уголок выделения. После того, как вы всё выделили, нажимайте на кнопку Apply и закрывайте Sprite Editor.",
                "<style=\"Sprite\"><sprite index=2></style>",
                "    Что бы увидеть на какие спрайты поделилось изображения, нажмите на стрелочку рядом с изображением. Но если вы перенесёте один из них на сцену, то увидите, что он слишком маленькие. Размеры спрайтов можно поменять в строке Scale, но тогда вам вручную придётся менять каждый раз каждый тайл. Лучше поменять значение поля “Pixels Per Unit” на 16. Можно сказать, что это скейл наших спрайтов на один unit (единица измерения расстояния).",
                "<style=\"Sprite\"><sprite index=3></style>",
                "    Теперь распределим спрайты на сцене. Для этого во вкладке иерархии добавим Tilemap (нажать ПКМ -> 2D Object -> Tilemap -> Rectangular). На сцене появилась сетка.",
                "<style=\"Sprite\"><sprite index=4></style>",
                "    Теперь вам нужно создать палетку спрайтов. Для этого наведите указатель мышки на Window, в открывшемся списке найдите пункт 2D, а внутри него выберите Tile Palette. И у вас должно появится окошко с соответствующей вкладкой. Вы можете перенести эту вкладку в любое место рядом с другой вкладкой, например, рядом с вкладкой Inspector.",
                "<style=\"Sprite\"><sprite index=5></style>",
                "    Далее вам нужно создать новую палитру с помощью кнопки Create New Palette. Так как в данном курсе вам потребуется создать один уровень, назовите её Level. Создайте две папки с именами Palettes и Tiles внутри папки Sprites (она находится в папке Assets). Сохраните свою палитру в папке Palettes.",
                "    Теперь перейдём к созданию тайлов. Возьмите самый первый спрайт и перенесите его в свою палитру, дайте ему название Gound и сохраните в папку Tiles. На вкладке Tile Palette выберите кисть и с помощью созданного тайла создайте землю, зажав ЛКМ на сцене и проведите линию.",
                "<style=\"Sprite\"><sprite index=6></style>",
                "    Для того, чтобы создать куст, состоящий из трёх элементов, перенесите на палитру все эти компоненты куста, назовите их следующим образом:",
                "  -  левую часть куста – LeftBush",
                "  -  центральную  часть – CenterBush",
                "  -  правую часть куста – RightBush",
                "    Выделите все три элемента и перенесите на сцену.",
                "    Если вам необходимо удалить тайл из палитры, выберите ластик и нажмите на ненужный элемент. После этого не забудьте удалить его из папки.",
                "<style=\"Sprite\"><sprite index=7></style>",
                "    Так как при разделении вы меняли размеры спрайтов тучек, вы можете их просто перенести на сцену, не использую палитру. Как вы могли заметить, на вкладке иерархии появилось несколько элементов, связанных с облаками. Что бы не засорять дерево иерархии, объединим все тучки в один элемент. Для этого нажмите ПКМ на вкладке и выберите Create Empty, и назовите его Clouds.",
                "<style=\"Sprite\"><sprite index=8></style>",
                "    <b>Задание:</b>"
            ],
            "video": null
        }
    ]
}